// pages/question/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    question:[
      {
        index:1,
        title:"献血前应该注意什么？",
        answer:"1.	献血前应尽可能适当休息，保证充足的睡眠。\n"+
        "2.	献血前一周内，若有上感、发热或腹泻等不适、服药以及妇女月经期间都应暂缓献血。\n"+
        "3.	献血前一天和当天不要吃油腻食物，如肥肉、油炸食物，不要饮酒。\n"+
        "4.	不能空腹献血，应当吃一些清淡食物。\n"+
        "5.	献血时请您一定携带有效证件（身份证、军官证、驾驶证、护照）",
      },{
        index:2,
        title:"献血对身体有什么好处？",
        answer:"1）降低血液的粘稠度，促进血液循环，避免血液瘀滞。\n" + 
        "2）献血浆和血小板还能够起到降低血液中脂肪含量，降低血脂的作用。\n" + 
        "3）献血后，献血者和直系亲属可享受一定免费的用血额度。",
      },{
        index:3,
        title:"哪些人不能献血？",
        answer:"1）有明显的心脑血管疾病、贫血、或者传染性疾病患者不可献血。\n" +
        "2）感冒、经期前后三天不可献血\n" +
        "3）上一次献过的不能参与此次献血活动。\n" +
        "（两次献血时间相隔不得小于六个月）",
      },{
        index:4,
        title:"献血对体格有什么要求？",
        answer:"1.	年龄：18周岁-55周岁（未满56周岁生日） \n" +
        "2.	体重：男≥50千克，女≥45千克\n" +
        "3.	血压：12～18.7／8～12千帕（90～140／60一90毫米汞柱）脉压差≥4千帕（≥30毫米汞柱）\n" +
        "4.	脉膊：60-100次／分，高度耐力的运动员50次／分\n" +
        "5.	体温正常",
      },{
        index:5,
        title:"我们的血液去哪了？",
        answer:"实际上，每一袋血液都可以追溯全过程，甚至用在哪个病人身上都能查到。\n" +
        "但出于对献血者和受血者隐私保密的考虑，国家并没有开放公开的平台让献血者跟踪自己血液的流向和使用情况。\n" +
        "不过，大家献出的血，经过分离和储存，检验合格后，很快就会送到各大医院，用于输血病人的救治。"
      },{
        index:6,
        title:"献血会影响健康吗？",
        answer:"不会\n" +
        "1. 献血200毫升不到全身血量的二十分之一，是不会影响血液的正常生理功能的。\n" +
        "2. 人体自身具有很强的调节功能，献血后1-2小时血容量就会得到恢复，各种血液成份可在两周内达到原来的水平。\n" +
        "3. 人体的血液都在新陈代谢，即使不献血，血细胞也在不断衰老死亡，被新生的血细胞代替。\n" +
        "献血后，人体造血功能更加旺盛，会加速血细胞的生成，从而使血液维持相对恒定。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})